run/pitzDaily_kEps/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
245
(
13.8955027366
13.8955027366
13.8955027366
13.8955027366
13.8955027366
13.8955027366
13.8955027366
13.8955027366
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
272
(
12.0968637042
12.0968637042
12.0968637042
12.0968637042
12.0968637042
12.0968637042
12.0968637042
12.0968637042
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
